9/data/attachments/66cd73b23d377696.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_9262bf53-9deb-459c-90d9-9c33d3ce0574</nif:username>
            <nif:friendToBeAdded>John_investment_Friend_75138_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>